Repository: Salakhoff/EditorPhoto
Catalog: *.lproj/Localizable.strings
Languages: ru

source: Invalid custom token.
ru: Неверный пользовательский токен.

source: Custom token mismatch.
ru: Несоответствие пользовательского токена.

# invalidCredential
source: Invalid credentials.
ru: Неверные учетные данные.

# userDisabled
source: User is disabled.
ru: Пользователь отключен.

source: Operation not allowed.
ru: Операция не разрешена.

# emailAlreadyInUse
source: Email is already in use.
ru: Электронная почта уже используется.

# invalidEmail
source: Invalid email address.
ru: Неверный адрес электронной почты.

source: Wrong password.
ru: Неверный пароль.

source: Too many requests.
ru: Слишком много запросов.

source: User not found.
ru: Пользователь не найден.

# accountExistsWithDifferentCredential
source: Account with different credentials already exists.
ru: Учетная запись с другими учетными данными уже существует.

# requiresRecentLogin
source: Recent login required.
ru: Требуется повторная аутентификация.

# providerAlreadyLinked
source: Provider is already linked to the account.
ru: Поставщик уже связан с аккаунтом.

source: No such provider.
ru: Поставщик не найден.

source: Invalid user token.
ru: Неверный пользовательский токен.

source: Network error.
ru: Сетевая ошибка.

source: User token expired.
ru: Срок действия пользовательского токена истек.

source: Invalid API key.
ru: Неверный API-ключ.

source: User mismatch.
ru: Несоответствие пользователей.

# credentialAlreadyInUse
source: Credentials are already in use.
ru: Учетные данные уже используются.

source: Weak password.
ru: Слабый пароль.

source: App not authorized.
ru: Приложение не авторизовано.

# expiredActionCode
source: Action code expired.
ru: Срок действия кода истек.

source: Invalid action code.
ru: Неверный код действия.

source: Invalid message payload.
ru: Неверная структура сообщения.

source: Invalid sender.
ru: Неверный отправитель.

source: Invalid recipient email.
ru: Неверный адрес получателя электронной почты.

source: Missing email.
ru: Отсутствует адрес электронной почты.

source: Missing iOS bundle ID.
ru: Отсутствует идентификатор пакета iOS.

source: Missing Android package name.
ru: Отсутствует название пакета Android.

source: Unauthorized domain.
ru: Неавторизованный домен.

source: Invalid continue URI.
ru: Неверный URI продолжения.

source: Missing continue URI.
ru: Отсутствует URI продолжения.

source: Missing phone number.
ru: Отсутствует номер телефона.

source: Invalid phone number.
ru: Неверный номер телефона.

source: Missing verification code.
ru: Отсутствует код проверки.

source: Invalid verification code.
ru: Неверный код проверки.

source: Missing verification ID.
ru: Отсутствует идентификатор проверки.

source: Invalid verification ID.
ru: Неверный идентификатор проверки.

# missingAppCredential
source: Missing app credentials.
ru: Отсутствуют учетные данные приложения.

# invalidAppCredential
source: Invalid app credentials.
ru: Неверные учетные данные приложения.

source: Session expired.
ru: Сеанс истек.

source: Quota exceeded.
ru: Превышен лимит.

source: Missing app token.
ru: Отсутствует токен приложения.

source: Notification not forwarded.
ru: Уведомление не перенаправлено.

source: App not verified.
ru: Приложение не подтверждено.

source: CAPTCHA check failed.
ru: Проверка капчи не пройдена.

source: Web context already presented.
ru: Контекст веб-приложения уже представлен.

source: Web context cancelled.
ru: Контекст веб-приложения отменен.

# appVerificationUserInteractionFailure
source: User interaction failure during app verification.
ru: Ошибка взаимодействия пользователя с подтверждением приложения.

source: Invalid client ID.
ru: Неверный идентификатор клиента.

source: Web network request failed.
ru: Ошибка сетевого запроса веб-приложения.

source: Web internal error.
ru: Внутренняя ошибка веб-приложения.

# webSignInUserInteractionFailure
source: User interaction failure during web sign in.
ru: Ошибка взаимодействия пользователя с входом в веб-приложение.

source: Local player not authenticated.
ru: Местный игрок не аутентифицирован.

source: Null user.
ru: Пустой пользователь.

source: Dynamic link not activated.
ru: Динамическая ссылка не активирована.

source: Invalid provider ID.
ru: Неверный идентификатор поставщика.

source: Tenant ID mismatch.
ru: Несоответствие идентификатора арендатора.

source: Unsupported tenant operation.
ru: Неподдерживаемая операция арендатора.

source: Invalid dynamic link domain.
ru: Неверный домен динамической ссылки.

source: Rejected credential.
ru: Отклоненные учетные данные.

source: GameKit not linked.
ru: GameKit не связан.

source: Second factor required.
ru: Требуется второй фактор.

source: Missing multi-factor session.
ru: Отсутствует сессия многофакторной аутентификации.

source: Missing multi-factor info.
ru: Отсутствуют сведения о многофакторной аутентификации.

source: Invalid multi-factor session.
ru: Неверная сессия многофакторной аутентификации.

source: Multi-factor info not found.
ru: Сведения о многофакторной аутентификации не найдены.

source: Admin restricted operation.
ru: Операция ограничена администратором.

source: Unverified email.
ru: Непроверенная электронная почта.

source: Second factor already enrolled.
ru: Второй фактор уже зарегистрирован.

source: Maximum second factor count exceeded.
ru: Превышено максимальное количество вторичных факторов

source: Unsupported first factor.
ru: Неподдерживаемый первичный фактор.

source: Email change needs verification.
ru: Требуется подтверждение изменения адреса электронной почты.

source: Missing client identifier.
ru: Отсутствует идентификатор клиента.

source: Missing or invalid nonce.
ru: Отсутствует или неверный nonce.

source: Blocking cloud function error.
ru: Ошибка блокирующей облачной функции.

# invalidPassword
source: Password must contain at least 8 characters, at least one letter and one number.
ru: Пароль должен содержать минимум 8 символов, хотя бы одну букву и одну цифру.

# passwordDoNotMatch
source: Passwords do not match.
ru: Пароли не совпадают.

source: Process photo.
ru: Обработать фотографию

# passwordRecoveryEmailSent
source: Password recovery email has been sent to your email.
ru: Письмо для восстановления пароля было отправлено на вашу электронную почту.

source: Cancel.
ru: Отменить

source: Forgot password?.
ru: Забыли пароль?

source: Save.
ru: Сохранить

source: Yes.
ru: Да

source: Add.
ru: Добавить

source: Error!.
ru: Ошибка...

source: Registration successful.
ru: Регистрация прошла успешно.

source: Log in.
ru: Войти

source: Successful!.
ru: Успешно!

source: Register.
ru: Зарегистрироваться

source: Recover password.
ru: Восстановить пароль

source: Write text...
ru: Напиши текст...

source: Bold.
ru: Жирный

source: No.
ru: Нет

source: Excellent!.
ru: Отлично!

source: Normal.
ru: Обычный

# noAccount
source: Don't have an account?.
ru: У вас нет аккаунта?

source: Editor.
ru: Редактор

source: Create new account.
ru: Создать новый аккаунт

# emailAdress
source: Email
ru: Эл.почта

source: Password
ru: Пароль

# replayPasssword
source: Repeat the password
ru: Повторите пароль

source: Great!
ru: Отлично!

source: Image saved successfully!
ru: Картинка успешно сохранена!

# confirmProfileExit
source: Do you really want to log out of your profile?
ru: Вы действительно хотите выйти из профиля?
